In [1]:
import numpy as np
import pandas as pd

有两种空值：None与np.nan

In [3]:
type(np.nan)

float

In [7]:
n = np.array([1,3,56,np.nan,6])
n

array([ 1.,  3., 56., nan,  6.])

In [12]:
n.sum()
np.nansum(n)#会过滤nan

np.float64(66.0)

## 但在pandas中None与np.nan均为np.nan

In [14]:
data = np.random.randint(0,100,size=(5,5))
df = pd.DataFrame(
    data=data,
    columns=list('abcde')
)
df

    a   b   c   d   e
0  27  69  36  61  96
1  13  20   6  88  75
2  54  16  58  67  68
3  49  41  13   4   6
4  27  18  98  28  81

In [18]:
df.iloc[1,1]=np.nan
df.iloc[3,4]=None
df

    a     b   c   d     e
0  27  69.0  36  61  96.0
1  13   NaN   6  88  75.0
2  54  16.0  58  67  68.0
3  49  41.0  13   4   NaN
4  27  18.0  98  28  81.0

### 一，找空值

#### 1，找空的列

In [21]:
#isnull,nan为True
df.isnull()
#notnull,nan为False
df.notnull()

      a      b     c     d      e
0  True   True  True  True   True
1  True  False  True  True   True
2  True   True  True  True   True
3  True   True  True  True  False
4  True   True  True  True   True

In [26]:
#all,全为True返回True
#any,全为False返回False
df.isnull().any()#常用找到nan的列
df.notnull().all()#常用找到不含nan的列

a     True
b    False
c     True
d     True
e    False
dtype: bool

#### 2，找空的行

In [30]:
#常用找到nan的行
df.isnull().any(axis=1)

#常用找到nan行
df.notnull().all(axis=1)

0     True
1    False
2     True
3    False
4     True
dtype: bool

### 二，过滤

#### 1,bool过滤

In [34]:
df
#行过滤
cond = df.isnull().any(axis=1)
df[~cond]
#列过滤同理

    a     b   c   d     e
0  27  69.0  36  61  96.0
2  54  16.0  58  67  68.0
4  27  18.0  98  28  81.0

#### 2，dropna过滤

In [42]:
#默认过滤行
df.dropna()
#修改列为
df.dropna(axis=1)

    a   c   d
0  27  36  61
1  13   6  88
2  54  58  67
3  49  13   4
4  27  98  28

In [43]:
#过滤为how
#all：均为nan，才删除
#any:有nan就删(默认)
df.dropna(how='all')

    a     b   c   d     e
0  27  69.0  36  61  96.0
1  13   NaN   6  88  75.0
2  54  16.0  58  67  68.0
3  49  41.0  13   4   NaN
4  27  18.0  98  28  81.0

In [44]:
#inplace修改原数据
df2 = df.copy()

df2.dropna(inplace=True)
df2

    a     b   c   d     e
0  27  69.0  36  61  96.0
2  54  16.0  58  67  68.0
4  27  18.0  98  28  81.0

#### 3,填充函数

##### (1),fillna()

In [46]:
df.fillna(value=100000)

    a         b   c   d         e
0  27      69.0  36  61      96.0
1  13  100000.0   6  88      75.0
2  54      16.0  58  67      68.0
3  49      41.0  13   4  100000.0
4  27      18.0  98  28      81.0

In [61]:
#limit限制次数
df

      a     b     c   d     e
0  27.0  69.0  36.0  61  96.0
1   NaN   NaN   NaN  88   0.0
2  54.0  16.0  58.0  67   0.0
3  49.0   NaN   NaN   4   NaN
4  27.0  18.0  98.0  28  81.0

In [63]:
df.fillna(value=0,limit=1,inplace=True)
df

      a     b     c   d     e
0  27.0  69.0  36.0  61  96.0
1   0.0   0.0   0.0  88   0.0
2  54.0  16.0  58.0  67   0.0
3  49.0   NaN   NaN   4   0.0
4  27.0  18.0  98.0  28  81.0

In [ ]:
#mathod
#method='ffill'向前
#method='backfill'向前
#method='ffill'，axis=1向左
#method='backfill'，axis=1向右